; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	satellite3 - satellite
	instrument6 - instrument
	instrument7 - instrument
	satellite4 - satellite
	instrument8 - instrument
	instrument9 - instrument
	thermograph1 - mode
	spectrograph0 - mode
	GroundStation5 - direction
	GroundStation1 - direction
	GroundStation6 - direction
	GroundStation3 - direction
	Star7 - direction
	GroundStation0 - direction
	Star2 - direction
	GroundStation4 - direction
	Phenomenon8 - direction
	Planet9 - direction
	Phenomenon10 - direction
	Star11 - direction
	Planet12 - direction
	Star13 - direction
	Phenomenon14 - direction
	Star15 - direction
	Planet16 - direction
)
(:init
	(supports instrument0 thermograph1)
	(calibration_target instrument0 GroundStation0)
	(calibration_target instrument0 GroundStation4)
	(supports instrument1 thermograph1)
	(supports instrument1 spectrograph0)
	(calibration_target instrument1 Star2)
	(supports instrument2 spectrograph0)
	(supports instrument2 thermograph1)
	(calibration_target instrument2 GroundStation0)
	(calibration_target instrument2 Star2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation4)
	(supports instrument3 thermograph1)
	(calibration_target instrument3 GroundStation5)
	(supports instrument4 spectrograph0)
	(supports instrument4 thermograph1)
	(calibration_target instrument4 GroundStation6)
	(calibration_target instrument4 GroundStation0)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation5)
	(supports instrument5 spectrograph0)
	(supports instrument5 thermograph1)
	(calibration_target instrument5 GroundStation1)
	(calibration_target instrument5 GroundStation3)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation6)
	(supports instrument6 spectrograph0)
	(supports instrument6 thermograph1)
	(calibration_target instrument6 GroundStation6)
	(calibration_target instrument6 GroundStation4)
	(supports instrument7 spectrograph0)
	(supports instrument7 thermograph1)
	(calibration_target instrument7 Star7)
	(calibration_target instrument7 GroundStation3)
	(on_board instrument6 satellite3)
	(on_board instrument7 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Phenomenon14)
	(supports instrument8 spectrograph0)
	(supports instrument8 thermograph1)
	(calibration_target instrument8 Star2)
	(calibration_target instrument8 GroundStation0)
	(supports instrument9 spectrograph0)
	(supports instrument9 thermograph1)
	(calibration_target instrument9 GroundStation4)
	(on_board instrument8 satellite4)
	(on_board instrument9 satellite4)
	(power_avail satellite4)
	(pointing satellite4 GroundStation1)
)
(:goal (and
	(pointing satellite0 Star7)
	(pointing satellite2 Planet12)
	(have_image Phenomenon8 thermograph1)
	(have_image Planet9 thermograph1)
	(have_image Phenomenon10 thermograph1)
	(have_image Star11 spectrograph0)
	(have_image Planet12 thermograph1)
	(have_image Star13 spectrograph0)
	(have_image Phenomenon14 thermograph1)
	(have_image Star15 spectrograph0)
	(have_image Planet16 thermograph1)
))

)

; plan
1. (turn_to satellite2 groundstation1 groundstation6)
   deleted: (pointing satellite2 groundstation6)
   added: (pointing satellite2 groundstation1)
   goals met: 0 of 11
2. (switch_on instrument5 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument5)
   goals met: 0 of 11
3. (calibrate satellite2 instrument5 groundstation1)
   added: (calibrated instrument5)
   goals met: 0 of 11
4. (turn_to satellite2 planet16 groundstation1)
   deleted: (pointing satellite2 groundstation1)
   added: (pointing satellite2 planet16)
   goals met: 0 of 11
5. (take_image satellite2 planet16 instrument5 thermograph1)
   added: (have_image planet16 thermograph1)
   goals met: 1 of 11
6. (turn_to satellite2 phenomenon8 planet16)
   deleted: (pointing satellite2 planet16)
   added: (pointing satellite2 phenomenon8)
   goals met: 1 of 11
7. (take_image satellite2 phenomenon8 instrument5 thermograph1)
   added: (have_image phenomenon8 thermograph1)
   goals met: 2 of 11
8. (turn_to satellite2 phenomenon14 phenomenon8)
   deleted: (pointing satellite2 phenomenon8)
   added: (pointing satellite2 phenomenon14)
   goals met: 2 of 11
9. (take_image satellite2 phenomenon14 instrument5 thermograph1)
   added: (have_image phenomenon14 thermograph1)
   goals met: 3 of 11
10. (turn_to satellite2 phenomenon10 phenomenon14)
   deleted: (pointing satellite2 phenomenon14)
   added: (pointing satellite2 phenomenon10)
   goals met: 3 of 11
11. (turn_to satellite0 star7 groundstation4)
   deleted: (pointing satellite0 groundstation4)
   added: (pointing satellite0 star7)
   goals met: 4 of 11
12. (take_image satellite2 phenomenon10 instrument5 thermograph1)
   added: (have_image phenomenon10 thermograph1)
   goals met: 5 of 11
13. (turn_to satellite2 planet9 phenomenon10)
   deleted: (pointing satellite2 phenomenon10)
   added: (pointing satellite2 planet9)
   goals met: 5 of 11
14. (take_image satellite2 planet9 instrument5 thermograph1)
   added: (have_image planet9 thermograph1)
   goals met: 6 of 11
15. (turn_to satellite2 star11 planet9)
   deleted: (pointing satellite2 planet9)
   added: (pointing satellite2 star11)
   goals met: 6 of 11
16. (take_image satellite2 star11 instrument5 spectrograph0)
   added: (have_image star11 spectrograph0)
   goals met: 7 of 11
17. (turn_to satellite2 star13 star11)
   deleted: (pointing satellite2 star11)
   added: (pointing satellite2 star13)
   goals met: 7 of 11
18. (take_image satellite2 star13 instrument5 spectrograph0)
   added: (have_image star13 spectrograph0)
   goals met: 8 of 11
19. (turn_to satellite2 star15 star13)
   deleted: (pointing satellite2 star13)
   added: (pointing satellite2 star15)
   goals met: 8 of 11
20. (take_image satellite2 star15 instrument5 spectrograph0)
   added: (have_image star15 spectrograph0)
   goals met: 9 of 11
21. (turn_to satellite2 planet12 star15)
   deleted: (pointing satellite2 star15)
   added: (pointing satellite2 planet12)
   goals met: 10 of 11
22. (take_image satellite2 planet12 instrument5 thermograph1)
   added: (have_image planet12 thermograph1)
   goals met: 11 of 11
